<?php

$x = ['a' => 3, 'b' => ['d' => 3, 'e' => 54]];

$array = ["a1" => ["b1",
    ["c1" => "abc", "c2" => "def"],
    "b3"],
    "a2" => "ghi"];
echo json_encode($array);

{"a1[b1][c1]":"abc","a1[b1][c2]":"def","a1[]":"b3","a2":"ghi"}

?>
<script type="text/javascript">
    Ext.ns('Ahura.store');
    Ahura.store.ProgramTypes=[[1,"کلاس/کارگاه آموزشی"],[10,"اردو/بازدید"],[20,"جشنواره"],[30,"گردهمایی (مراسم/سخنرانی/جشن/اجرای برنامه هنری/میزگرد/نمایش فیلم/...)"],[40,"نمایشگاه"],[50,"مسابقه"],[100,"دیگر"],[110,"نشریه"],[120,"راهپیمایی/تجمع"]];
    Ahura.store.Degrees=[[6,"کاردانی"],[7,"کارشناسی"],[8,"کارشناسی ارشد"],[9,"پسادکتری"],[11,"دکتری"]];
    Ahura.store.Religion=[[1,"مسلمان (مذهب نامشخص)"],[2,"مسلمان (اهل تشیع)"],[3,"مسلمان (اهل تسنن)"],[4,"ارمنی/مسیحی"],[5,"کلیمی/یهودی"],[6,"زرتشتی"],[7,"دیگر"],[8,"نامشخص"]];
    Ahura.store.EntityType=[[a,"انجمن علمی"],[k,"کانون فرهنگی"],[t,"تشکل اسلامی"],[s,"شورای صنفی"],[x,"نهاد غیر دانشجویی"],[,"دیگر"],[team,"تیم ورزشی"],[basij,"بسیج دانشجویی"]];
    Ahura.store.ProgramSubjects=[[2,"علمی/دانشیک"],[4,"فرهنگی"],[6,"سیاسی"],[8,"اجتماعی"],[10,"دینی/عقیدتی"],[14,"هنری"],[16,"تفریحی"],[18,"ورزشی"],[20,"ادبی"],[22,"پژوهشی"],[24,"دیگر"],[25,"صنفی"],[26,"طنز"],[27,"خبری"]];
    Ahura.store.ProgramLevels=[[10,"کلاس"],[20,"گروه آموزشی"],[30,"دانشکده"],[40,"خوابگاه"],[50,"دانشکده"],[60,"دانشگاه"],[70,"شهرستان"],[80,"استان"],[90,"منطقه کشوری"],[95,"کشور"],[99,"بین الملل"]];
    /*
     Ahura.store.ProgramSubjects = [
     [20, "اجتماعی"],
     [26, "ادبی"],
     [27, "پژوهشی"],
     [24, "تفریحی"],
     [49, "خبری"],
     [28, "دیگر"],
     [21, "دینی/عقیدتی"],
     [19, "سیاسی"],
     [47, "صنفی"],
     [48, "طنز"],
     [17, "علمی/پژوهشی"],
     [18, "فرهنگی"],
     [25, "ورزشی"],
     [23, "هنری"]
     ];

     Ahura.store.ProgramLevels = [
     [12, "استان"],
     [15, "بین الملل"],
     [8, "خوابگاه"],
     [7, "دانشکده"],
     [9, "دانشکده"],
     [10, "دانشگاه"],
     [11, "شهرستان"],
     [14, "کشور"],
     [5, "کلاس"],
     [6, "گروه آموزشی"],
     [13, "منطقه کشوری"]
     ];
     */

    Ahura.store.Colleges = [
        [3, "ادبیات و علوم انسانی"],
        [4, "الهیات"],
        [1, "علوم پایه"],
        [5, "علوم تربیتی و روانشناسی"],
        [6, "فناوری اطلاعات"],
        [2, "فنی و مهندسی"]
    ];
    Ahura.store.Departments = [
        [9, "ادیان"],
        [23, "برق"],
        [7, "تاریخ و تمدن"],
        [16, "تربیت بدنی"],
        [17, "روانشناسی"],
        [12, "ریاضی"],
        [1, "زبان و ادبیات انگلیسی"],
        [3, "زبان و ادبیات عربی"],
        [2, "زبان و ادبیات فارسی"],
        [14, "زیست شناسی"],
        [10, "شیمی"],
        [15, "علوم تربیتی"],
        [21, "عمران"],
        [4, "فقه و حقوق"],
        [5, "فلسفه"],
        [20, "فناوری اطلاعات"],
        [11, "فیزیک"],
        [6, "قرآن"],
        [18, "کتابداری"],
        [13, "کشاورزی"],
        [19, "مطالعات خانواده"],
        [8, "معارف"],
        [22, "مکانیک"],
        [24, "مواد"]
    ];
    Ahura.store.Courses = [
        [1, "روزانه"],
        [2, "شبانه"],
        [3, "دبیری"],
        [4, "غیر حضوری"],
        [5, "مجازی"],
        [6, "بین الملل"]
    ];
    Ahura.store.Disciplines = [
        [44, "آمورش زبان و ادبیات  ■ کارشناسی ارشد ناپیوسته ■ روزانه"],
        [45, "آمورش زبان و ادبیات  ■ کارشناسی ارشد ناپیوسته ■ شبانه"],
        [37, "ادیان و عرفان تطبیقی ■ کارشناسی ارشد ناپیوسته ■ روزانه"],
        [36, "ادیان و عرفان تطبیقی ■ کارشناسی پیوسته ■ روزانه"],
        [71, "امور زراعی ■ کاردانی ناپیوسته ■ روزانه"],
        [61, "برق - قدرت ■ کارشناسی پیوسته ■ روزانه"],
        [88, "برق- الکترونیک ■ کارشناسی پیوسته ■ دبیری"],
        [90, "برق- قدرت ■ کارشناسی ارشد ناپیوسته ■ روزانه"],
        [87, "برق- قدرت ■ کارشناسی پیوسته ■ دبیری"]
    ];

    Ahura.store.Terms =[];
    for(var i=moment().jYear()-10;i<=moment().jYear()+1;i++){
        Ahura.store.Terms.push(i+'03');
        Ahura.store.Terms.push(i+'06');
        Ahura.store.Terms.push(i+'11');
    }
</script>