var Mehr = Mehr || {};
Mehr.user = true;
Mehr.licensee = 'معاونت فرهنگی و اجتماعی دانشگاه شهید بهشتی (دمو)';
Mehr.constants = {
    "entityType": {"tm": "تیم ورزشی", "s": "شورای صنفی", "t": "تشکل اسلامی", "k": "کانون فرهنگی", "a": "انجمن علمی", "x": "نهاد غیر دانشجویی", "o": "", "sport": "انجمن ورزشی", "bs": "بسیج دانشجویی (دانشکده)"},
    "course": {"2": "شبانه", "1": "روزانه", "6": "نیمه‌حضوری", "5": "دبیری", "4": "بین‌الملل", "3": "مجازی"},
    "council": {"a": "شورای حمايت و نظارت بر انجمن‌های علمي", "f": "شوراي فرهنگي", "n": "کمیته ناظر برنشریات دانشجویی", "k": "شورای هماهنگی کانونهای فرهنگی", "t": "هیئت نظارت بر تشکلهای دانشجویی"},
    "audienceLevel": {"99": "بین الملل", "95": "کشور", "90": "منطقه کشوری", "80": "استان", "70": "شهرستان", "50": "دانشکده", "60": "دانشگاه", "10": "کلاس", "20": "گروه آموزشی", "30": "دانشکده", "40": "خوابگاه"},
    "plan_status": {"10": "لغو شده", "15": "انجام شده", "25": "منتظر تصویب", "20": "تصویب شده", "30": "در حال اجرا"},
    "plan_comment": {"refer": "ارجاع به", "cancel": "رد", "edit": "نیاز به اصلاح جزئی", "change": "نیاز به اصلاح", "ok": "تایید"},
    "period": {"0180": "دوفصلنامه", "0090": "فصلنامه", "0060": "دوماهنامه", "0030": "ماهنامه", "0001": "روزنامه", "0007": "هفته نامه", "0014": "دوهفته نامه", "0360": "سالنامه", "3000": "ویژه نامه", "2000": "تکشماره", "1000": "گاهنامه"},
    "councilMembership": {"understudy": "عضو علي البدل شورای مرکزی", "councillor": "عضو شورای مرکزی", "secretary": "دبیر"},
    "membership": {"canceled": "لغو عضویت", "applied": "درخواست عضویت", "active": "عضو برجسته", "member": "عضو عادی"},
    "entityTpye": {"sp": "انجمن ورزشی"},
    "enrollmentStatus": {"final": "نهایی", "pre": "اولیه", "guest": "مهمان", "alternative": "ذخیره", "committee": "عضو تیم اجرایی", "professor": "استاد"},
    "maritalStatus": {"s": "تجرد", "m": "تأهل", "d": "طلاق", "k": "فوت همسر"},
    "programType": {"1": "کلاس\/کارگاه", "10": "اردو\/بازدید", "20": "جشنواره", "30": "برنامه جمعی", "40": "نمایشگاه", "50": "مسابقه", "100": "دیگر", "120": "راهپیمایی\/تجمع", "35": "نمایش فیلم"},
    "religion": {"1": "مسلمان (مذهب نامشخص)", "2": "مسلمان (اهل تشیع)", "3": "مسلمان (اهل تسنن)", "4": "ارمنی\/مسیحی", "5": "کلیمی\/یهودی", "6": "زرتشتی", "7": "دیگر", "8": "نامشخص"},
    "subject": {"2": "علمی", "4": "فرهنگی", "6": "سیاسی", "8": "اجتماعی", "10": "دینی\/آئینی", "14": "هنری", "16": "تفریحی", "18": "ورزشی", "20": "ادبی", "22": "پژوهشی", "24": "دیگر", "25": "صنفی", "26": "طنز", "27": "خبری"},
    "timeStage": {"c": "جاری", "p": "گذشته", "f": "آینده"},
    "userType": {"2": "استاد", "1": "دانشجو", "3": "کارمند", "4": "عضو", "5": "کاربر تعریف شده"},
    "postType": {"program": "برنامه", "news": "خبر", "entity": "نهاد", "issue": "نشریه"}
};
